Revit 2024 API
WorksetPreview.IsDefaultWorkset Property
 Whether the workset is the default one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsDefaultWorkset { get; }
Visual Basic
Public ReadOnly Property IsDefaultWorkset As Boolean
	Get
Visual C++
public:
property bool IsDefaultWorkset {
	bool get ();
}
See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace